justimepassnow/custom_servo/mm32_test/pack_extracted/MindMotion.MM32G0001_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>MindMotion</vendor>
  <url>http://www.mindmotion.com.cn/Download/MDK_KEIL/</url>  
  <name>MM32G0001_DFP</name>
  <description>MindMotion Cortex-Mx Series Device Family Pack</description>

  <releases>
		<release version="1.0.1" >
       Release version of MM32G0001 Device Family Pack.
    </release>

  </releases>


<devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="MM32G0001 Series" Dvendor="MindMotion:132">
    <processor Dcore="Cortex-M0"  DcoreVersion="r0p0" Dfpu="0" Dmpu = "0" Dendian="Little-endian"/>
 
    <description>
MM32G0001 Series
    </description>


    <!-- ************************  Subfamily 'MM32M0xx Series'  **************************** -->
        <subFamily DsubFamily="MM32G0001A">
            <description>
Subfamily: MM32G0001A

Frequency: 48MHz 
Memory: 16 kB Flash, 2 kB RAM
Communication: 2 x USART, 1 x SPI, 1 x I2C
Analog : ADC
power saving mode:stop, sleep mode

            </description>
            <device Dname="MM32G0001A6TC">

                <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000" />
                <debug svd="SVD/MM32G0001.svd" />
                <memory id="IROM1" start="0x08000000" size="0x00004000" startup="1" default="1" />
                <memory id="IRAM1" start="0x20000000" size="0x00000800" init="0" default="1" />
                <algorithm name="Flash/MM32G0001_16.FLM" start="0x08000000" size="0x00004000" default="1" />
            </device>
            <device Dname="MM32G0001A1TC">
                <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000" />
                <debug svd="SVD/MM32G0001.svd" />
                <memory id="IROM1" start="0x08000000" size="0x00004000" startup="1" default="1" />
                <memory id="IRAM1" start="0x20000000" size="0x00000800" init="0" default="1" />
                <algorithm name="Flash/MM32G0001_16.FLM" start="0x08000000" size="0x00004000" default="1" />
        
            </device>
            <device Dname="MM32G0001A1NC">
                <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000" />
                <debug svd="SVD/MM32G0001.svd" />
                <memory id="IROM1" start="0x08000000" size="0x00004000" startup="1" default="1" />
                <memory id="IRAM1" start="0x20000000" size="0x00000800" init="0" default="1" />
                <algorithm name="Flash/MM32G0001_16.FLM" start="0x08000000" size="0x00004000" default="1" />

            </device>
        </subFamily>
    </family>
</devices>

</package>